cus_name = input("ลูกค้าชื่อ-สกุล: ")
product = input("ชื่อสินค้า: ")
price = int(input("ราคาของสินค้า (ไม่นับภาษีมูลค่าเพิ่มเติม): "))  # การใส่ Input หากต้องการแทรกข้อมูลตัวเลขต้องมี int นำหน้าก่อนแล้วใส่ input ตามหลังในวงเล็บแรกแล้วเขียนคล้ายๆ 2 บรรทัดแรก
vat_price = price*(7/100)  # เปรียบเป็นสมการในคณิตได้ว่า ราคาสินค้าคูณด้วยภาษี 7% ซึ่งมาจาก 7/100
price_com_success = price+vat_price
print('\n')  # print('\n') เป็นคำสั่งเว้นบรรทัดโดยไม่ต้องพิมพ์ตัวอักษร
print("=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-") # ไม่จำเป็นต้องทำตาม
print("คุณ"+cus_name)
print("ชื่อสินค้า: " + product)
print("ยอดราคาสินค้า: " + '%.2f' % price, "บาท")
print("ราคาภาษีมูลค่าเพิ่ม: " + '%.2f' % vat_price, "บาท")
print("ยอดรวมสุทธิ: " + '%.2f' % price_com_success, "บาท")
print("=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-") # ไม่จำเป็นต้องทำตาม
print('\n')  # print('\n') เป็นคำสั่งเว้นบรรทัดโดยไม่ต้องพิมพ์ตัวอักษร
