#  การคำนวณค่าไฟฟ้า
print("****************************************")
print("การไฟฟ้าส่วนภูมิภาค")
print("****************************************")
watt = float(input("กรุณากรอกกำลังไฟฟ้า (วัตต์):"))
device = int(input("กรุณากรอกจำนวนเครื่องใช้ไฟฟ้า:"))
use_time = int(input("กรุณากรอกจำนวนชั่วโมงที่ใช้ใน 1 วัน:"))
unit = (watt * device / 1000 * use_time)

print("จำนวนหน่วยต่อวันคิดเป็น: ", '%.2f' % unit, "ยูนิต")
if unit <= 50:
    print("\033[91m\033[1m=-=-=-=-=-=-=-=-=-==- \033[91m\033[1m[ !!! ] \033[91m\033[1m-=-=-=-=-=-=-=-=-=-=-")
    print("\033[91m\033[1m ยกเว้นการจ่ายค่าไฟฟ้า ตามประเภทที่ 1 บ้านอยู่อาศัยอัตรา 1.1 \033[0m(อัตราปกติ แบบก้าวหน้า)")
    print("\033[91m\033[1m หากใช้ไฟฟ้าไม่เกิน 50 หน่วยต่อเดือนและติดตั้งเครื่องวัดฯ ขนาดไม่เกิน 5(15) แอมแปร์ ")
    print("\033[0m ได้รับการยกเว้นค่าไฟฟ้าในเดือนนั้น")
    print("\033[91m\033[1m=-=-=-=-=-=-=-=-=-==- \033[91m\033[1m[ !!! ] \033[91m\033[1m-=-=-=-=-=-=-=-=-=-=-")
else:
    print('\n')
if 51 <= unit <= 100:
    elc = (2.348 * 15) + (2.988 * 10) + (3.241 * 10) + (3.623 * (unit - 35))
    elc_service = elc + 8.19
    ft = 0.1160
    ft_service = elc_service * ft
    bill = 38.22
    ft_all = elc_service - ft_service
    elc_all = ft_all + bill
    vat = elc_all * 0.07
    total = elc_all + vat
    print("****************************************")
    print("ค่าบริการไฟฟ้าฐานรวม:", '%.2f' % elc_service, "บาท")
    print("ค่า Ft:", ft, "บาท")
    print("ค่าบริการรายเดือน:", '%.2f' % bill, "บาท")
    print("รวมเงินค่าไฟฟ้า:", '%.2f' % elc_all, "บาท")
    print("ภาษีมูลค่าเพิ่ม 7%:", '%.2f' % vat, "บาท")
    print("\033[92m\033[1mรวมยอดที่ต้องชำระทั้งสิ้น:", '%.2f' % total, "บาท")
    print("\033[0m****************************************")
elif 101 <= unit <= 150:
    elc = (2.348 * 15) + (2.988 * 10) + (3.241 * 10) + (3.623 * 65) + (3.717 * (unit - 100))
    elc_service = elc + 8.19
    ft = 0.1160
    ft_service = elc_service * ft
    bill = 38.22
    ft_all = elc_service - ft_service
    elc_all = ft_all + bill
    vat = elc_all * 0.07
    total = elc_all + vat
    print("****************************************")
    print("ค่าบริการไฟฟ้าฐานรวม:", '%.2f' % elc_service, "บาท")
    print("ค่า Ft:", ft, "บาท")
    print("ค่าบริการรายเดือน:", '%.2f' % bill, "บาท")
    print("รวมเงินค่าไฟฟ้า:", '%.2f' % elc_all, "บาท")
    print("ภาษีมูลค่าเพิ่ม 7%:", '%.2f' % vat, "บาท")
    print("\033[92m\033[1mรวมยอดที่ต้องชำระทั้งสิ้น:", '%.2f' % total, "บาท")
    print("\033[0m****************************************")
elif 151 <= unit <= 400:
    elc = (2.348 * 15) + (2.988 * 10) + (3.241 * 10) + (3.623 * 65) + (3.717 * 50) + (4.221 * (unit - 150))
    elc_service = elc + 8.19
    ft = 0.1160
    ft_service = elc_service * ft
    bill = 38.22
    ft_all = elc_service - ft_service
    elc_all = ft_all + bill
    vat = elc_all * 0.07
    total = elc_all + vat
    print("****************************************")
    print("ค่าบริการไฟฟ้าฐานรวม:", '%.2f' % elc_service, "บาท")
    print("ค่า Ft:", ft, "บาท")
    print("ค่าบริการรายเดือน:", '%.2f' % bill, "บาท")
    print("รวมเงินค่าไฟฟ้า:", '%.2f' % elc_all, "บาท")
    print("ภาษีมูลค่าเพิ่ม 7%:", '%.2f' % vat, "บาท")
    print("\033[92m\033[1mรวมยอดที่ต้องชำระทั้งสิ้น:", '%.2f' % total, "บาท")
    print("\033[0m****************************************")
elif unit > 400:
    elc = (2.348 * 15) + (2.988 * 10) + (3.241 * 10) + (3.623 * 65) + (3.717 * 50) + (4.221 * 250) + (4.42 * (unit
                                                                                                              - 400))
    elc_service = elc + 8.19
    ft = 0.1160
    ft_service = elc_service * ft
    bill = 38.22
    ft_all = elc_service - ft_service
    elc_all = ft_all + bill
    vat = elc_all * 0.07
    total = elc_all + vat
    print("****************************************")
    print("ค่าบริการไฟฟ้าฐานรวม:", '%.2f' % elc_service, "บาท")
    print("ค่า Ft:", -ft, "บาท")
    print("ค่าบริการรายเดือน:", '%.2f' % bill, "บาท")
    print("รวมเงินค่าไฟฟ้า:", '%.2f' % elc_all, "บาท")
    print("ภาษีมูลค่าเพิ่ม 7%:", '%.2f' % vat, "บาท")
    print("\033[92mรวมยอดที่ต้องชำระทั้งสิ้น:", '%.2f' % total, "บาท")
    print("\033[0m****************************************")
else:
    elc = 0
