#  ใบงานที่ 2.6 ส่วนของบรรทัด 1 และ # ตามข้อความสามารถลบได้เลย (ทดสอบแล้ว)
product_name = input("กรุณากรอกชื่อสินค้า: ")  # บรรทัดที่ 2
product_price = float(input("กรุณากรอกราคาสินค้า: "))  # บรรทัดที่ 3
product_amount = int(input("กรุณากรอกจำนวนสินค้า: "))  # บรรทัดที่ 4
all_price = product_price * product_amount  # บรรทัดที่ 5
discount = all_price * 10 / 100  # บรรทัดที่ 6
net_price = all_price - discount  # บรรทัดที่ 7
print("*************************")  # บรรทัดที่ 8
print("การคำนวณส่วนลดการซื้อสินค้า")  # บรรทัดที่ 9
print("*************************")  # บรรทัดที่ 10
print("สินค้า: ", product_name)  # บรรทัดที่ 11
print("รราคา", '%.2f' % product_price, "บาท")  # บรรทัดที่ 12
print("จำนวนที่ซื้อ", product_amount, "ชิ้น")  # บรรทัดที่ 13
print("รวมราคาสินค้า", '%.2f' % all_price, "บาท")  # บรรทัดที่ 14
print("ส่วนลด 10%", '%.2f' % discount, "บาท")  # บรรทัดที่ 15
print("***************************")  # บรรทัดที่ 16
print("ราคาสุทธิ", '%.2f' % net_price, "บาท")  # บรรทัดที่ 17
