# ใบงานที่ 2.7.2

print("************************************************************")

print("การคำนวณภาษี")

print("************************************************************")

staff_name = input("ชื่อพนักงาน:")

income = float(input("รายได้:"))

print("************************************************************")

if income <= 500000 :

  vat = income * (5/100)

  net_income = income - vat

  print("ภาษี:", '%.2f' % vat,"บาท")

  print("รายได้สุทธิ:", '%.2f' % net_income,"บาท")

else :

  vat = income * (10/100)

  net_income = income - vat

  print("ภาษี:", '%.2f' % vat,"บาท")

  print("รายได้สุทธิ:", '%.2f' % net_income,"บาท")

print("************************************************************")
